#+title: My First Org File
#+datePublished: 2024-11-10
#+dateModified: 2024-11-20
#+tags: astro org-mode
#+draft: false

#+title: Index
iThis is the index inside the blog folder.
#+TITLE: ORGOME

Welcome to my blog! Here are some sections and links:

- [[../][Sobre mi]]

* ORGOM
** ORG MODE

#+NAME: Example Org Post with Code
#+BEGIN_SRC python
import random

secret_number = random.randint(1, 100)

while True:
    guess = int(input("Guess the number between 1 and 100: "))

    if guess == secret_number:
        print("Congratulations! You guessed the number!")
        break
    elif guess < secret_number:
        print("Too low! Try again.")
    else:
        print("Too high! Try again.")

#+END_SRC


#+NAME: Pythonesco
#+begin_src ansi
ANSI colors:
- Regular: [31mRed[0m [32mGreen[0m [33mYellow[0m [34mBlue[0m [35mMagenta[0m [36mCyan[0m
- Bold:    [1;31mRed[0m [1;32mGreen[0m [1;33mYellow[0m [1;34mBlue[0m [1;35mMagenta[0m [1;36mCyan[0m
- Dimmed:  [2;31mRed[0m [2;32mGreen[0m [2;33mYellow[0m [2;34mBlue[0m [2;35mMagenta[0m [2;36mCyan[0m

256 colors (showing colors 160-177):
[38;5;160m160 [38;5;161m161 [38;5;162m162 [38;5;163m163 [38;5;164m164 [38;5;165m165[0m
[38;5;166m166 [38;5;167m167 [38;5;168m168 [38;5;169m169 [38;5;170m170 [38;5;171m171[0m
[38;5;172m172 [38;5;173m173 [38;5;174m174 [38;5;175m175 [38;5;176m176 [38;5;177m177[0m

Full RGB colors:
[38;2;34;139;34mForestGreen - RGB(34, 139, 34)[0m

Text formatting: [1mBold[0m [2mDimmed[0m [3mItalic[0m [4mUnderline[0m
#+end_src

#+RESULTS: Blog post list
#+begin_example
- [[file:2024-11-19-mastodon.org][Mastodon]]
- [[file:2024-11-19-red-hat-power!.org][Red Hat power!]]

- [[file:post1.org][Post 1]]
#+end_example